Autodesk.Revit.UI.FilterDialog.Show
Shows the FilterDialog editing dialog to the user.
Remarks:
If an existing FilterElement id was set during construction of the object or through the FilterToSelect property,
that FilterElement will be selected for editing.
If a new filter name was set during construction of the object or through the NewFilterName property,
a new ParameterFilterElement will be created and that new element will be selected for editing.
If this option was chosen, the id of the explicitly create new filter will be stored in the NewFilterId property.
Note that the user may opt to add, delete or edit any of the available filter elements (or make no changes at all).
To monitor which filters have been changed, use other Revit API mechanisms such as Dynamic Update or the DocumentChanged event.
Since:
2015

Autodesk.Revit.UI.FilterDialog.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.UI.FilterDialog.NewFilterName
The name of the new ParameterFilterElement to be created and selected once Show is invoked.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: newFilterName is an empty string.
-or-
When setting this property: newFilterName cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
-or-
When setting this property: The supplied filter name newFilterName is not unique.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2015

Autodesk.Revit.UI.FilterDialog.FilterToSelect
The filter element to be selected once Show is invoked.
The default is InvalidElementId, resulting in selecting the first available (if any) FilterElement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The supplied ElementId id is not of a FilterElement.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2015

Autodesk.Revit.UI.FilterDialog.NewFilterId
The ElementId of the new filter created.
The value is populated after Show method is executed.
Since:
2015

Autodesk.Revit.UI.FilterDialog.#ctor(Autodesk.Revit.DB.Document,System.String)
Constructs a new instance of the FilterDialog class,
while setting the name of the new ParameterFilterElement to be created and selected for editing.
Remarks:
Show the dialog with the Show() method after setting the desired options.
doc:
The document that owns the FilterElements displayed and edited in the dialog.
name:
The user-visible name for the new ParameterFilterElement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name is an empty string.
-or-
name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
-or-
The given value for name is already in use as a filter element name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.UI.FilterDialog.#ctor(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Constructs a new instance of the FilterDialog class,
while setting the id of the FilterElement to be selected when the dialog is shown.
Remarks:
Show the dialog with the Show() method after setting the desired options.
doc:
The document that owns the FilterElements displayed and edited in the dialog.
filterToSelect:
The FilterElement to be selected.
If InvalidElementId, then the first (if any) available FilterElement will be selected.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The supplied ElementId filterToSelect is not of a FilterElement.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.UI.FilterDialog
Allows display of the dialog used to create and edit FilterElements in Autodesk Revit.
Remarks:
The class provides the option to launch the dialog by selecting an existing FilterElement,
or automatically creating a new ParameterFilterElement.
In both cases the affected element will be selected for editing.
Note that the user may opt to add, delete or edit any of the available filter elements (or make no changes at all).
Since:
2015